<?php

/************************************************************************/
/*  Электричество  v1.oo                                                */
/************************************************************************/


if (!isset($body))  die ('error: this is a pluggable module and cannot be used standalone.');



$module['name'] = 'Электричество';
//$module['nameb'] = 'Электричество';


$module['perm'] = array('edit'  => 'редактор',
//                        'note'  => 'ред.примечаний',
                        );

?>